/*
Тест

Эта глава проще и более абстрактная, чем предыдущие главы, поэтому этот тест будет лаконичным.

Задание №1

Какие типы отношений (композиция, агрегация, ассоциация или зависимость) описываются ниже?

a) Класс Животное, который содержит Тип Животного и его Имя. b) Класс TextEditor с методом Save(),
который принимает объект file. Метод Save() записывает содержимое редактора на диск.

Комозиция

c) Класс Авантюрист, который может хранить разные Предметы: мечи, копья, зелья или книги заклинаний.
Эти Предметы могут быть отброшены и подняты другими Авантюристами.

Агрегация

d) Программист использует Компьютер для просмотра видео с котами в Интернете.

Ассоциация

e) Класс Компьютер, который содержит класс Процессор. Процессор можно вынуть из Компьютера и посмотреть.

Композиция

Задание №2

Если вы можете создать класс, используя композицию, агрегацию, ассоциацию или зависимость, то что вы выберите?

Композицию или агрегацию так как тип однонаправленных отношений, с построением из более простых обьектов более сложных, мне представляется более информаитивным.
*/